Autodesk.Revit.DB.Structure.RebarShapeVertex.SetConstraints(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarShapeConstraint})
Assign a new list of constraints to this vertex.
Remarks:
Any existing constraints are discarded. The new constraints replace them.
Any parameters driving the constraints must already be added
with RebarShapeDefinition.AddParameter().
The allowable constraint types are:
RebarShapeConstraintRadiusRebarShapeConstraintArcLength
Any number of constraints may be specified. With no constraints,
the bend radius will default to the appropriate bend radius
from the RebarBarType element.
constraints:
A new list of constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more of the constraints is of a type not supported for RebarShapeVertex.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012